// Процедурне програмування — набір не пов'язаних функцій і змінних для
// зберігання та обробки інформації. 

const summa = 20000;
const month = 12;
const p = 1000;

const credit = (summa, date, p) => {
    return summa + p * date;
};

console.log(credit(summa, month, p));

// Об'єктно-Орієнтоване Програмування (ООП) - один з методів програмування,
// який розглядає програму як множину «об'єктів», що взаємодіють між собою.
// ООП представляє програмне забезпечення як сукупність взаємних об'єктів, а не
// просто набір команд чи функцій як у традиційному програмуванні.

const sumCredit = {
    summa: 20000,
    month: 12,
    p: 1000,
    result() {
        return this.summa + this.p * this.month;
    },
};

console.log(sumCredit.result());
